var store = [{
        "title": "M1 맥 개발환경 설정 - (1) 홈브루(Homebrew) 설치",
        "excerpt":"서론 M1 Pro가 탑재된 2021 맥북프로 16’를 구매해서, 환경설정을 다시 할 필요성이 있었다. 이전 M1 맥북에어 환경설정을 할 땐 이리저리 충돌난걸 ‘야매’로 고쳐서 겨우겨우 돌아가게 한 것들이 많았기 때문에 이번 기회에 깔끔하게 설치도 해보고, 그 기록을 남기고자 한다. 1. Homebrew 설치. Homebrew(홈브루)는 Mac OS용 패키지 관리자이다. (apt-get과 비슷한 느낌) 사실...","categories": ["macOS"],
        "tags": ["홈브루","환경설정"],
        "url": "/macos/Mac-OS-settings-1/",
        "teaser": null
      },{
        "title": "M1 맥 개발환경 설정 - (2) iTerm2 설치 및 설정",
        "excerpt":"서론 M1 Pro가 탑재된 2021 맥북프로 16’를 구매해서, 환경설정을 다시 할 필요성이 있었다. 이전 M1 맥북에어 환경설정을 할 땐 이리저리 충돌난걸 ‘야매’로 고쳐서 겨우겨우 돌아가게 한 것들이 많았기 때문에 이번 기회에 깔끔하게 설치도 해보고, 그 기록을 남기고자 한다. iTerm2 설치 및 설정 난 원래 순정 터미널 사용자였지만, 기왕 맥북을 바꾼김에...","categories": ["macOS"],
        "tags": ["환경설정","터미널","iTerm2"],
        "url": "/macos/Mac-OS-settings-2/",
        "teaser": null
      },{
        "title": "M1 맥 개발환경 설정 - (3) React Native 개발 환경 설정",
        "excerpt":"서론 M1 Pro가 탑재된 2021 맥북프로 16’를 구매해서, 환경설정을 다시 할 필요성이 있었다. 이전 M1 맥북에어 환경설정을 할 땐 이리저리 충돌난걸 ‘야매’로 고쳐서 겨우겨우 돌아가게 한 것들이 많았기 때문에 이번 기회에 깔끔하게 설치도 해보고, 그 기록을 남기고자 한다. React Native 개발 환경 설정 동아리에서 React Native로 앱을 개발한지 어언 1년이...","categories": ["macOS"],
        "tags": ["환경설정","리액트 네이티브"],
        "url": "/macos/Mac-OS-settings-3/",
        "teaser": null
      },{
        "title": "M1 맥 개발환경 설정 - (4) 안드로이드 스튜디오 설치",
        "excerpt":"서론 M1 Pro가 탑재된 2021 맥북프로 16’를 구매해서, 환경설정을 다시 할 필요성이 있었다. 이전 M1 맥북에어 환경설정을 할 땐 이리저리 충돌난걸 ‘야매’로 고쳐서 겨우겨우 돌아가게 한 것들이 많았기 때문에 이번 기회에 깔끔하게 설치도 해보고, 그 기록을 남기고자 한다. 안드로이드 스튜디오 설치 최근 뜬금없이 안드로이드 앱 외주를 맡게 되었기 때문에 안드로이드...","categories": ["macOS"],
        "tags": ["환경설정","안드로이드"],
        "url": "/macos/Mac-OS-settings-4/",
        "teaser": null
      },{
        "title": "M1 맥 개발환경 설정 - (5) Jekyll 환경설정",
        "excerpt":"서론 M1 Pro가 탑재된 2021 맥북프로 16’를 구매해서, 환경설정을 다시 할 필요성이 있었다. 이전 M1 맥북에어 환경설정을 할 땐 이리저리 충돌난걸 ‘야매’로 고쳐서 겨우겨우 돌아가게 한 것들이 많았기 때문에 이번 기회에 깔끔하게 설치도 해보고, 그 기록을 남기고자 한다. Jekyll 환경설정 이 블로그는 Jekyll의 아주 유명한 테마인 Minimal Mistakes로 만들어졌다. 그리고...","categories": ["macOS"],
        "tags": ["환경설정","지킬"],
        "url": "/macos/Mac-OS-settings-5/",
        "teaser": null
      }]
